artillery/environments/10k.testbed.gitlab.net.yml
config:
  target: http://10k.testbed.gitlab.net

  variables:
    PROJECT_GROUP: qa-perf-testing
    PROJECT_NAME: gitlabhq
    PROJECT_COMMIT_SHA: 0a99e022
    PROJECT_BRANCH: 10-0-stable
    PROJECT_FILE_PATH: qa%2Fqa%2Erb
    PROJECT_MR_COMMITS_IID: 10495
    PROJECT_MR_DISCUSSIONS_IID: 6958
    PROJECT_SIGNED_COMMIT_SHA: 6526e91f

  phases:
    - duration: 5
      arrivalRate: 1
      rampTo: 2
      name: "Warm up"

    - duration: 15
      arrivalRate: 2
      rampTo: 20
      name: "Ramp Up"

    - duration: 45
      arrivalRate: 20
      name: "Full Load"