artillery/environments/10k.testbed.gitlab.net.yml
config:
  target: http://10k.testbed.gitlab.net

  defaults:
    headers:
      PRIVATE-TOKEN: "{{ $processEnvironment.ACCESS_TOKEN }}"

  variables:
    GITLABHQ_GROUP: qa-perf-testing
    GITLABHQ_PROJECT: gitlabhq
    GITLABHQ_COMMIT_SHA: 0a99e022
    GITLABHQ_BRANCH_NAME: 10-0-stable
    GITLABHQ_FILE_PATH: qa%2Fqa%2Erb
    GITLABHQ_MR_IID: 10495
    GITLABHQ_SIGNED_COMMIT_SHA: 6526e91f

  phases:
    - duration: 5
      arrivalRate: 1
      rampTo: 2
      name: "Warm up"

    - duration: 15
      arrivalRate: 2
      rampTo: 20
      name: "Ramp Up"

    - duration: 45
      arrivalRate: 20
      name: "Full Load"