artillery/environments/onprem.testbed.gitlab.net.yml
config:
  target: https://onprem.testbed.gitlab.net

  variables:
    PROJECT_GROUP: qa-perf-testing
    PROJECT_NAME: gitlabhq
    PROJECT_COMMIT_SHA: 0a99e022
    PROJECT_BRANCH: 10-0-stable
    PROJECT_FILE_PATH: qa%2Fqa%2Erb
    PROJECT_MR_COMMITS_IID: 10495
    PROJECT_MR_NOTES_IID: 6946
    PROJECT_SIGNED_COMMIT_SHA: 6526e91f

  phases:
    - duration: 2
      arrivalRate: 1
      rampTo: 2
      name: "Warm up"

    - duration: 10
      arrivalRate: 2
      name: "Load"